{
  "title": "Reducing Risk in Frontend Development with Docker",
  "stage": "draft",
  "tags": "nodejs, docker, frontend",
  "comments": true,
  "theme": "queenblue",
  "meta": {
    "index": 0,
    "fileName": "2018-04-18-reducing-risk-in-frontend-development-with-docker.md",
    "section": "/",
    "dirName": "/posts"
  },
  "date": "2018-04-18",
  "path": "/posts/posts/reducing-risk-in-frontend-development-with-docker",
  "permalink": "/posts/reducing-risk-in-frontend-development-with-docker",
  "anchors": [],
  "body": "<p>You and your team have been working on a website for the last couple of weeks, everything is good. But now there’s a new team member and they need to get their machine setup.</p>\n<p>Perhaps you’d goto to the NodeJS website and download whatever version, run the installer and attempt to install the tools for your project.</p>\n<p>Or maybe you’ve discovered that you need a better way to manage the versions of nodejs you need. So you go an install Nodist or Nvm depending on your operating system.</p>\n<p>Then you’d try and install the projects tools, because you’re a smart cookie you’ve described all this in your <code>package.json</code>. Hopeful faces abound as you run <code>npm install</code>.</p>\n<p>But now you’re experiencing mysterious installation issues, pngquant won’t install for some reason, node-sass can’t find some binding thing, and there’s a problem with something being too long.</p>\n<p>If only there was a more reliable way to get a new team member up and running with the project, A way to ensure that your project doesn’t rely on 3rd party repositories to make a build.</p>\n<p>There is, here’s what I’ve learnt.</p>\n<h2>Engine Version Managers</h2>\n<p>New nodejs versions are released frequently, mostly with new shiny features.</p>\n<p>So you’d have to ensure that once you got everything working, that you also specified what version of node to use.</p>\n<p>They work nicely on macosx and linux, because bash is awesome. but bash doesn’t exist on windows… so yeah, you’ll be managing two sets of manifests to describe the environment.</p>\n<h2>Virtual Machines</h2>\n<p>Five years ago, teams working on Django, Symphony, Ruby on Rails or Laravel would use something like Virtualbox (kvm, VMWare, etc) to bake an operating system, the project and its dependencies. You’d end up with an image that could be anywhere from 1-4gb depending on your choice of operating system.</p>\n<p>Windows and .Net developers however seem to handle this differently. I’ve never met or heard of anyone in that area creating a virtual machine containing Windows, IIS and MSSQL, probably because they’re used to downloading and storing dependencies in their project since the dawn of time, or more likely because such an image would end up being 20-60gb.</p>\n<p>If you didn’t use Vagrant, your virtual machine image is now ready for use.</p>\n<p>I actually used Vagrant in the past to simulate my production environment while coding. It’s great way to be exposed to production problems sooner, which means you won’t code your self into a corner because you didn’t realise x library doesn’t communicate across the network layer.</p>\n<p>But it’s slow. start up times are slow, host &lt;-&gt; vm file sync is slow and tricky and running even one vm uses up huge amounts of host memory.</p>\n<h2>Primary Risks</h2>\n<p>Show stoppers I’ve encountered:</p>\n<ul>\n<li>package author removes their package from npm (padleft)</li>\n<li>packages have post install compile steps, which the package author isn’t mitigating or hasn’t tested. Post build step performs network operations <em>will</em> fail.</li>\n<li>Our internet connection died because Telstra technician unilaterally decides to unplug our router/modem</li>\n<li>Some problem with intermediate caching on our machines is causing an incorrect package to be installed.</li>\n<li>Python wasn’t installed, so node-gyp doesn’t run, so can’t install node-sass.</li>\n<li>Node-gyp wasn’t installed globally.</li>\n<li>Random version of MSbuild wasn’t installed, some post install build process defined a node-gyp step that requires it.</li>\n<li>Git wasn’t installed, or more precisely it was un-installed and team member decided that source tree internal git over http was good enough.</li>\n<li>Some post build processes attempt to clean-up, but can’t because some aspects of windows don’t like paths longer than 256 characters.</li>\n<li>Package author doesn’t like windows, won’t account for it and is hostile to any suggestions that their architecture contributes to the monumental amount of bug tickets regarding installation of their package.</li>\n</ul>\n<p>These are just the ones I can remember, but to narrow them down into defined domains lets call them:</p>\n<ul>\n<li>“hostile deprecation”</li>\n<li>“network dependant”</li>\n<li>“ignorant post installation”</li>\n<li>“obscure system requirements”</li>\n</ul>\n<h3>Hostile Deprecation</h3>\n<p>every time you <code>npm i</code> or <code>pip install</code> or <code>bundle install</code> or <code>nuget install</code> you’re at the mercy of people like the author of <code>pad-left</code> or <code>imagemin</code>.</p>\n<p>Some of these authors are doe eyed enthusiastic people, they’ve yet to encounter what a colleague of mine explained to me as:</p>\n<p class=\"quote\">We are like diamonds, slowly eroded by the persistent drips of reality into thin lubricating substance that keeps software running smoothly.\n<em>– Anon Colleague</em></p>\n<p>What’s that? you can’t install a package and you have to create a prod build for deployment in an hour… oh what a shame.</p>\n<h2>Where to from here?</h2>\n<p>Over the last two years at Fusion, I’ve had to move outside the well crafted world of linux into that of MacOSx and Windows 7 and 10. Each of these systems have different ways of doing things on the filesystem, they have different ways of interpreting code and while NodeJS claims to be cross-platform (and it is), the reality is that most module authors are on linux or macosx, the automated tests they write rarely run cross platform or on multiple versions of node.</p>\n<p>As a frontend developer there are some things I’ve learnt with regards to the tooling we use, the solutions I came up with as I reached our current game plan were influenced by what I learnt while commercially developing Django projects.</p>\n"
}